nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/trustzone_examples/secure_faults/secure_faults_s/tzm_config.c
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: TEE v4.0
processor: MIMXRT685S
package_id: MIMXRT685SFVKB
mcu_data: ksdk2_0
processor_version: 11.0.1
board: MIMXRT685-AUD-EVK
toolOptions:
  _output_type_: c_code
  _legacy_source_names_: 'yes'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

/***********************************************************************************************************************
 * Included files
 **********************************************************************************************************************/
#include "fsl_common.h"
#include "tzm_config.h"

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/* SAU region boundaries */
#define XIP_SAU_REGION_0_BASE 0x08100000U
#define XIP_SAU_REGION_0_END  0x081FFFFFU
#define XIP_SAU_REGION_1_BASE 0x180FFE00U
#define XIP_SAU_REGION_1_END  0x180FFFFFU
#define XIP_SAU_REGION_2_BASE 0x20180000U
#define XIP_SAU_REGION_2_END  0x20201FFFU

/* SAU region boundaries */
#define RAM_SAU_REGION_0_BASE 0x000C0000U
#define RAM_SAU_REGION_0_END  0x0013FFFFU
#define RAM_SAU_REGION_1_BASE 0x100BFE00U
#define RAM_SAU_REGION_1_END  0x100BFFFFU
#define RAM_SAU_REGION_2_BASE 0x20180000U
#define RAM_SAU_REGION_2_END  0x20201FFFU
#define RAM_SAU_REGION_3_BASE 0x08041000U
#define RAM_SAU_REGION_3_END  0x080C0FFFU

/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
functional_group:
- called_from_default_init: 'false'
- id_prefix: 'XIP_'
- prefix_user_defined: 'false'
- name: 'XIP'
- description: ''
- ahb:
  - pins_masks:
    - pio0: {Non-masked: {id: ['0', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '3',
          '30', '31', '4', '5', '6', '7', '8', '9']}, Masked: {id: ['1', '2']}}
    - pio1: {Non-masked: {id: ['0', '1', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '2', '20', '21', '22', '23', '24', '25', '26', '27', '28',
          '29', '3', '30', '31', '4', '5', '6', '7', '8', '9']}}
    - pio2: {Non-masked: {id: ['0', '1', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '2', '20', '21', '22', '23', '24', '25', '26', '27', '28',
          '29', '3', '30', '31', '4', '5', '6', '7', '8', '9']}}
  - regions: [{memory: BootROM, security: s_priv, start: '0x00000000', size: '0x00040000'}, {memory: FLEXSPI_FLASH, security: s_priv, start: '0x00000000', size: '0x00100000'},
    {memory: FLEXSPI_FLASH, security: ns_user, start: '0x00100000', size: '0x07F00000'}, {memory: SRAM_ROM, security: ns_user, start: '0x00000000', size: '0x00020000'},
    {memory: SRAM_SHARED, security: ns_user, start: '0x00000000', size: '0x00060000'}, {memory: SRAM, security: ns_user, start: '0x00000000', size: '0x00080000'},
    {memory: SRAM, security: s_priv, start: '0x00080000', size: '0x00080000'}, {memory: SRAM, security: ns_user, start: '0x00100000', size: '0x00080000'}, {memory: SRAM_DSP,
      security: s_priv, start: '0x00000000', size: '0x00002000'}, {memory: SRAM_DSP, security: ns_user, start: '0x00002000', size: '0x0027E000'}, {memory: TCMD, security: ns_user,
      start: '0x00000000', size: '0x00010000'}, {memory: TCMI, security: ns_user, start: '0x00000000', size: '0x00010000'}, {memory: USB_RAM, security: ns_user, start: '0x00000000',
      size: '0x00004000'}]
  - masters: {ns_user: {id: [DMA0, DMA1, DSP, POWERQUAD, SDIO0, SDIO1]}}
  - peripherals: {ns_user: {id: [ADC0, CASPER, CMP, CRC_ENGINE, CTIMER0, CTIMER1, CTIMER2, CTIMER3, CTIMER4, DMA0, DMA1, DMIC0, FLEXCOMM1, FLEXCOMM14, FLEXCOMM15,
        FLEXCOMM2, FLEXCOMM3, FLEXCOMM4, FLEXCOMM5, FLEXCOMM6, FLEXCOMM7, FLEXSPI, FREQME, GPIO, HASHCRYPT, I3C, INPUTMUX, MRT0, MUA, MUB, OSTIMER0, OSTIMER1, PINT,
        POWERQUAD, PUF, RTC, SCT0, SECGPIO, SEMA42, TRNG, USBHSD, USBHSH, USBPHY, USDHC0, USDHC1, UTICK0, WWDT0, WWDT1]}, s_priv: {id: [CLKCTL0, CLKCTL1, FLEXCOMM0,
        IOPCTL, RSTCTL0, RSTCTL1, SYSCTL0, SYSCTL1]}}
- sau:
  - enabled: 'true'
  - all_non_secure: 'false'
  - generate_code_for_disabled_regions: 'false'
  - regions: [{index: '0', enabled: 'true', security: ns, start: '0x08100000', size: '0x00100000'}, {index: '1', enabled: 'true', security: nsc, start: '0x180FFE00',
      size: '0x00000200'}, {index: '2', enabled: 'true', security: ns, start: '0x20180000', size: '0x00082000'}, {index: '3', enabled: 'false', security: ns, start: '0x00000000',
      size: '0x00000020'}, {index: '4', enabled: 'false', security: ns, start: '0x00000000', size: '0x00000020'}, {index: '5', enabled: 'false', security: ns, start: '0x00000000',
      size: '0x00000020'}, {index: '6', enabled: 'false', security: ns, start: '0x00000000', size: '0x00000020'}, {index: '7', enabled: 'false', security: ns, start: '0x00000000',
      size: '0x00000020'}]
- global_options:
  - no:
    - id: [AIRCR_PRIS, AIRCR_BFHFNMINS, AIRCR_SYSRESETREQS, SCR_SLEEPDEEPS, SHCSR_SECUREFAULTENA, NSACR_CP2, NSACR_CP3, NSACR_CP4, NSACR_CP5, NSACR_CP6, NSACR_CP7,
      CPPWR_SU0, CPPWR_SUS0, CPPWR_SU1, CPPWR_SUS1, CPPWR_SU2, CPPWR_SUS2, CPPWR_SU3, CPPWR_SUS3, CPPWR_SU4, CPPWR_SUS4, CPPWR_SU5, CPPWR_SUS5, CPPWR_SU6, CPPWR_SUS6,
      CPPWR_SU7, CPPWR_SUS7, CPPWR_SU10, CPPWR_SUS10, CPPWR_SU11, CPPWR_SUS11, SEC_GPIO_MASK0_LOCK, SEC_GPIO_MASK1_LOCK, SEC_GPIO_MASK2_LOCK, SEC_DSP_INT_MASK_LOCK,
      MASTER_SEC_LEVEL_LOCK, CPU0_LOCK_NS_VTOR, CPU0_LOCK_NS_MPU, CPU0_LOCK_S_VTAIRCR, CPU0_LOCK_S_MPU, CPU0_LOCK_SAU, CPU0_LOCK_REG_LOCK, AHB_MISC_CTRL_REG_ENABLE_S_PRIV_CHECK,
      AHB_MISC_CTRL_REG_ENABLE_NS_PRIV_CHECK, AHB_MISC_CTRL_REG_DISABLE_VIOLATION_ABORT, AHB_MISC_CTRL_REG_DISABLE_SIMPLE_MASTER_STRICT_MODE, AHB_MISC_CTRL_REG_DISABLE_SMART_MASTER_STRICT_MODE,
      AHB_MISC_CTRL_REG_IDAU_ALL_NS]
  - yes:
    - id: [NSACR_CP0, NSACR_CP1, NSACR_CP10, NSACR_CP11, AHB_MISC_CTRL_REG_ENABLE_SECURE_CHECKING, AHB_MISC_CTRL_REG_WRITE_LOCK]
- user_memory_regions: []
- mpus:
  - mpu:
    - enabled: 'false'
    - id: 's'
    - priv_default_map: 'false'
    - handler_enabled: 'false'
    - generate_code_for_disabled_regions: 'false'
    - attributes: [{index: '0', id: Code, memory_type: normal, device: nGnRE}, {index: '1', id: RAM, memory_type: normal, device: nGnRE}, {index: '2', id: Peripheral,
        memory_type: device, device: nGnRE}, {index: '3', id: '3', memory_type: device, device: nGnRE}, {index: '4', id: '4', memory_type: device, device: nGnRE},
      {index: '5', id: '5', memory_type: device, device: nGnRE}, {index: '6', id: '6', memory_type: device, device: nGnRE}, {index: '7', id: '7', memory_type: device,
        device: nGnRE}]
    - regions: [{executable: 'false', read_only: 'false', attributes_index: '0', index: '0', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'},
      {executable: 'false', read_only: 'false', attributes_index: '0', index: '1', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false',
        read_only: 'false', attributes_index: '0', index: '2', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false',
        attributes_index: '0', index: '3', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0',
        index: '4', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0', index: '5',
        enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0', index: '6', enabled: 'false',
        security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0', index: '7', enabled: 'false', security: priv,
        start: '0x00000000', size: '0x00000020'}]
  - mpu:
    - enabled: 'false'
    - id: 'ns'
    - priv_default_map: 'false'
    - handler_enabled: 'false'
    - generate_code_for_disabled_regions: 'false'
    - attributes: [{index: '0', id: Code, memory_type: normal, device: nGnRE}, {index: '1', id: RAM, memory_type: normal, device: nGnRE}, {index: '2', id: Peripheral,
        memory_type: device, device: nGnRE}, {index: '3', id: '3', memory_type: device, device: nGnRE}, {index: '4', id: '4', memory_type: device, device: nGnRE},
      {index: '5', id: '5', memory_type: device, device: nGnRE}, {index: '6', id: '6', memory_type: device, device: nGnRE}, {index: '7', id: '7', memory_type: device,
        device: nGnRE}]
    - regions: [{executable: 'false', read_only: 'false', attributes_index: '0', index: '0', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'},
      {executable: 'false', read_only: 'false', attributes_index: '0', index: '1', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false',
        read_only: 'false', attributes_index: '0', index: '2', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false',
        attributes_index: '0', index: '3', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0',
        index: '4', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0', index: '5',
        enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0', index: '6', enabled: 'false',
        security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0', index: '7', enabled: 'false', security: priv,
        start: '0x00000000', size: '0x00000020'}]
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

