nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/trustzone_examples/secure_faults/secure_faults_s/tzm_config.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : XIP
 * Description   :
 *
 * END ****************************************************************************************************************/

/***********************************************************************************************************************
 * XIP_BOARD_InitTrustZone function
 **********************************************************************************************************************/
void XIP_BOARD_InitTrustZone()
{
    /* SAU configuration */

    /* Set SAU Control register: Disable SAU and All Secure */
    SAU->CTRL = 0;

    /* Set SAU region number */
    SAU->RNR = 0;
    /* Region base address */
    SAU->RBAR = XIP_SAU_REGION_0_BASE & SAU_RBAR_BADDR_Msk;
    /* Region end address */
    SAU->RLAR = (XIP_SAU_REGION_0_END & SAU_RLAR_LADDR_Msk) | ((0U << SAU_RLAR_NSC_Pos) & SAU_RLAR_NSC_Msk) |
                ((1U << SAU_RLAR_ENABLE_Pos) & SAU_RLAR_ENABLE_Msk);

    /* Set SAU region number */
    SAU->RNR = 1;
    /* Region base address */
    SAU->RBAR = XIP_SAU_REGION_1_BASE & SAU_RBAR_BADDR_Msk;
    /* Region end address */
    SAU->RLAR = (XIP_SAU_REGION_1_END & SAU_RLAR_LADDR_Msk) | ((1U << SAU_RLAR_NSC_Pos) & SAU_RLAR_NSC_Msk) |
                ((1U << SAU_RLAR_ENABLE_Pos) & SAU_RLAR_ENABLE_Msk);

    /* Set SAU region number */
    SAU->RNR = 2;
    /* Region base address */
    SAU->RBAR = XIP_SAU_REGION_2_BASE & SAU_RBAR_BADDR_Msk;
    /* Region end address */
    SAU->RLAR = (XIP_SAU_REGION_2_END & SAU_RLAR_LADDR_Msk) | ((0U << SAU_RLAR_NSC_Pos) & SAU_RLAR_NSC_Msk) |
                ((1U << SAU_RLAR_ENABLE_Pos) & SAU_RLAR_ENABLE_Msk);

    /* Force memory writes before continuing */
    __DSB();
    /* Flush and refill pipeline with updated permissions */
    __ISB();

    /* Set SAU Control register: Enable SAU and All Secure (applied only if disabled) */
    SAU->CTRL = ((0U << SAU_CTRL_ALLNS_Pos) & SAU_CTRL_ALLNS_Msk) | ((1U << SAU_CTRL_ENABLE_Pos) & SAU_CTRL_ENABLE_Msk);

    /* AHB configuration */

    /*--------------------------------------------------------------------
     - AHB Security Level Configurations
     -------------------------------------------------------------------*/
    /* Configuration of AHB Secure Controller
       Possible values for every memory sector or peripheral rule:
        0    Non-secure, User access allowed.
        1    Non-secure, Privileged access allowed.
        2    Secure, User access allowed.
        3    Secure, Privileged access allowed.
    */

    /* Security level configuration of MPC checker */
    AHB_SECURE_CTRL->RAM00_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM00_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM00_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM00_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM01_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM01_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM01_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM01_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM02_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM02_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM02_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM02_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM03_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM03_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM03_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM03_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM04_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM04_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM04_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM04_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM05_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM05_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM05_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM05_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM06_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM06_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM06_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM06_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM07_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM07_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM07_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM07_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM08_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM08_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM08_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM08_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM09_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM09_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM09_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM09_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM10_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM10_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM10_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM10_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM11_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM11_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM11_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM11_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM12_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM12_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM12_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM12_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM13_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM13_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM13_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM13_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM14_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM14_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM14_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM14_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM15_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM15_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM15_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM15_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM16_RULE[0]            = 0x33333333U;
    AHB_SECURE_CTRL->RAM16_RULE[1]            = 0x33333333U;
    AHB_SECURE_CTRL->RAM16_RULE[2]            = 0x33333333U;
    AHB_SECURE_CTRL->RAM16_RULE[3]            = 0x33333333U;
    AHB_SECURE_CTRL->RAM17_RULE[0]            = 0x33333333U;
    AHB_SECURE_CTRL->RAM17_RULE[1]            = 0x33333333U;
    AHB_SECURE_CTRL->RAM17_RULE[2]            = 0x33333333U;
    AHB_SECURE_CTRL->RAM17_RULE[3]            = 0x33333333U;
    AHB_SECURE_CTRL->RAM18_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM18_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM18_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM18_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM19_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM19_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM19_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM19_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM20_RULE[0]            = 0x00000003U;
    AHB_SECURE_CTRL->RAM20_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM20_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM20_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM21_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM21_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM21_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM21_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM22_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM22_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM22_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM22_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM23_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM23_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM23_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM23_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM24_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM24_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM24_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM24_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM25_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM25_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM25_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM25_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM26_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM26_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM26_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM26_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM27_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM27_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM27_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM27_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM28_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM28_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM28_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM28_RULE[3]            = 0;
    AHB_SECURE_CTRL->RAM29_RULE[0]            = 0;
    AHB_SECURE_CTRL->RAM29_RULE[1]            = 0;
    AHB_SECURE_CTRL->RAM29_RULE[2]            = 0;
    AHB_SECURE_CTRL->RAM29_RULE[3]            = 0;
    AHB_SECURE_CTRL->ROM_MEM_RULE[0]          = 0x33333333U;
    AHB_SECURE_CTRL->ROM_MEM_RULE[1]          = 0x33333333U;
    AHB_SECURE_CTRL->ROM_MEM_RULE[2]          = 0x33333333U;
    AHB_SECURE_CTRL->ROM_MEM_RULE[3]          = 0x33333333U;
    AHB_SECURE_CTRL->PIF_HIFI4_X_MEM_RULE0    = 0;
    AHB_SECURE_CTRL->FLEXSPI0_REGION0_RULE[0] = 0x00003333U;
    AHB_SECURE_CTRL->FLEXSPI0_REGION0_RULE[1] = 0;
    AHB_SECURE_CTRL->FLEXSPI0_REGION0_RULE[2] = 0;
    AHB_SECURE_CTRL->FLEXSPI0_REGION0_RULE[3] = 0;
    AHB_SECURE_CTRL->FLEXSPI0_REGION1_RULE0   = 0;
    AHB_SECURE_CTRL->FLEXSPI0_REGION2_RULE0   = 0;
    AHB_SECURE_CTRL->FLEXSPI0_REGION3_RULE0   = 0;
    AHB_SECURE_CTRL->FLEXSPI0_REGION4_RULE0   = 0;
    AHB_SECURE_CTRL->AHB_PERIPH2_SLAVE_RULE0  = 0;

    /* Security level configuration of PPC checker */
    AHB_SECURE_CTRL->APB_GRP0_MEM_RULE0      = 0xFCFFFFFFU;
    AHB_SECURE_CTRL->APB_GRP0_MEM_RULE1      = 0xCCFFFFFFU;
    AHB_SECURE_CTRL->APB_GRP1_MEM_RULE0      = 0xFCCFFFFFU;
    AHB_SECURE_CTRL->APB_GRP1_MEM_RULE1      = 0xCCCCCCCCU;
    AHB_SECURE_CTRL->APB_GRP1_MEM_RULE2      = 0xFCFFFFFCU;
    AHB_SECURE_CTRL->AHB_PERIPH0_SLAVE_RULE0 = 0xFCCCFCCCU;
    AHB_SECURE_CTRL->AIPS_BRIDGE0_MEM_RULE0  = 0xFFFCCCCCU;
    AHB_SECURE_CTRL->AHB_PERIPH1_SLAVE_RULE0 = 0xCCCCCCCCU;
    AHB_SECURE_CTRL->AIPS_BRIDGE1_MEM_RULE0  = 0xCCFCFFFFU;
    AHB_SECURE_CTRL->AIPS_BRIDGE1_MEM_RULE1  = 0xFFFFCCCCU;
    AHB_SECURE_CTRL->AHB_PERIPH2_SLAVE_RULE0 = 0xFFFFCCCFU;
    AHB_SECURE_CTRL->AHB_PERIPH3_SLAVE_RULE0 = 0xFFFCCFCCU;

