nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/trustzone_examples/secure_faults/secure_faults_s/tzm_config.c
    /* Security level configuration of masters */
    AHB_SECURE_CTRL->MASTER_SEC_LEVEL          = 0x80000000U;
    AHB_SECURE_CTRL->MASTER_SEC_LEVEL_ANTI_POL = 0xBFFFFFFFU;

    /*--------------------------------------------------------------------
     - Pins: Reading GPIO state
     -------------------------------------------------------------------*/
    /* Possible values for every pin:
     *  0b0    Deny
     *  0b1    Allow */
    AHB_SECURE_CTRL->SEC_GPIO_MASK0 = 0xFFFFFFF9U;
    AHB_SECURE_CTRL->SEC_GPIO_MASK1 = 0xFFFFFFFFU;
    AHB_SECURE_CTRL->SEC_GPIO_MASK2 = 0xFFFFFFFFU;
    AHB_SECURE_CTRL->SEC_GPIO_MASK3 = 0xFFFFFFFFU;
    AHB_SECURE_CTRL->SEC_GPIO_MASK4 = 0xFFFFFFFFU;
    AHB_SECURE_CTRL->SEC_GPIO_MASK7 = 0xFFFFFFFFU;

    /*--------------------------------------------------------------------
     - Interrupts: Interrupt security configuration
     -------------------------------------------------------------------*/
    /* Possible values for every interrupt:
     *  0b0    Secure
     *  0b1    Non-secure */
    NVIC->ITNS[0] = 0;
    NVIC->ITNS[1] = 0;

    /* Global Options */
    SCB->AIRCR = (SCB->AIRCR & 0x000009FF7U) | 0x005FA0000U;
    SCB->SCR &= 0x0FFFFFFF7U;
    SCB->SHCSR &= 0x0FFF7FFFFU;
    SCB->NSACR                        = 0x00000C03U;
    SCnSCB->CPPWR                     = 0;
    AHB_SECURE_CTRL->SEC_MASK_LOCK    = (AHB_SECURE_CTRL->SEC_MASK_LOCK & 0x0FFFCFFC0U) | 0x00002002AU;
    AHB_SECURE_CTRL->MASTER_SEC_LEVEL = (AHB_SECURE_CTRL->MASTER_SEC_LEVEL & 0x03FFFFFFFU) | 0x080000000U;
    AHB_SECURE_CTRL->MASTER_SEC_LEVEL_ANTI_POL =
        (AHB_SECURE_CTRL->MASTER_SEC_LEVEL_ANTI_POL & 0x03FFFFFFFU) | 0x080000000U;
    AHB_SECURE_CTRL->CM33_LOCK_REG    = 0x800002AAU;
    AHB_SECURE_CTRL->MISC_CTRL_REG    = 0x0000AAA5U;
    AHB_SECURE_CTRL->MISC_CTRL_DP_REG = 0x0000AAA5U;
}

/***********************************************************************************************************************
 * BOARD_InitBootTEE function
 **********************************************************************************************************************/
void BOARD_InitBootTEE()
{
}
